Repository: UlfDunkel/UDO
Catalog: udosh/po/*.po
Languages: de

source: Choose application for %s file...
de: Anwendung für %s Dateien wählen...

source: Format Configuration
de: Format Konfiguration

source: Destination
de: Ziel

source: Result
de: Ergebnis

source: File type
de: Filetyp

source: Suffix:
de: Endung:

source: lowercase file names
de: Dateinamen klein schreiben

source: Unix path for application
de: Unix-Pfad für Anwenung

source: Wait for completion
de: Auf beende warten

source: Options
de: Optionen

source: Args:
de: Argumente:

source: Choose UDO Help file...
de: UDO Hilfe-Datei auswählen...

source: Shell Options
de: Shell Optionen

source: Shell always on top
de: Shell-Fenster immer oben

source: Create directories
de: Verzeichnisse erzeugen

source: Use integrated UDO%s
de: Eingebaute UDO-Version benutzen%s

source: UDO Helpfile:
de: UDO Hilfe-Datei:

source: Topic:
de: Überschrift:

source: UDO can't create log file
de: UDO kann Log-Datei nicht anlegen

source: UDO can't create tree file
de: UDO kann Tree-Datei nicht anlegen

source: UDO can't create project file
de: UDO kann Projekt-Datei nicht anlegen

source: UDO can't create hyphen file
de: UDO kann Trenn-Datei nicht anlegen

source: UDO can't create output file
de: UDO kann Ausgabe-Datei nicht anlegen

source: No help file found
de: Hilfe-Datei nicht gefunden

source: %s: too early for dialog?
de: %s: zu früh für Dialoge?

source: convert to ASCII
de: ins ASCII-Format konvertieren

source: convert to AmigaGuide
de: ins AmigaGuide-Format konvertieren

source: convert to Apple QuickView
de: ins Apple-QuickView-Format konvertieren

source: generate C sourcecode
de: C-Sourcecode erzeugen

source: convert to David's Readme Compiler format
de: ins David's-Readme-Compiler-Format konvertieren

source: generate PDFLaTeX sourcecode
de: ins PDFLaTeX-Format konvertieren

source: convert to HP Helptag SGML
de: ins HP-Helptag-SGML-Format konvertieren

source: convert to HTML
de: ins HTML-Format konvertieren

source: convert to HTML Apple Help
de: ins HTML-Apple-Help-Format konvertieren

source: convert to HTML-Help
de: ins HTML-Help-Format konvertieren

source: convert to GNU Texinfo
de: ins GNU-Texinfo-Format konvertieren

source: convert to OS/2 IPF format
de: ins OS/2-IPF-Format konvertieren

source: convert to LyX
de: ins LyX-Format konvertieren

source: convert to a manualpage
de: in eine Manualpage konvertieren

source: convert to nroff
de: ins nroff-Format konvertieren

source: convert to Pure C Help
de: ins Pure-C-Help-Quelltextformat konvertieren

source: generate Pascal sourcecode
de: Pascal-Sourcecode erzeugen

source: convert to PostScript
de: ins PostScript-Format konvertieren

source: convert to RTF
de: ins Rich Text Format konvertieren

source: convert to ST-Guide
de: ins ST-Guide-Quelltextformat konvertieren

source: convert to LaTeX
de: ins LaTeX-Format konvertieren

source: collect all files and save in UDO format
de: Dateien sammeln und in einer UDO-Datei sichern

source: convert to Turbo Vision Help
de: ins Turbo-Vision-Help-Format konvertieren

source: convert to WinHelp
de: ins WinHelp-Quelltextformat konvertieren

source: convert to WinHelp4
de: ins WinHelp4-Quelltextformat konvertieren

source: convert to Linuxdoc SGML
de: ins Linuxdoc-SGML-Format konvertieren

source: save always long filenames
de: immer lange Dateinamen erzeugen

source: save always short filenames
de: immer kurze Dateinamen erzeugen

source: don't generate index file (.ux?)
de: kein Indexfile (.ux?) anlegen

source: don't generate hyphen file (.uh?)
de: kein Hyphenfile (.uh?) anlegen

source: don't generate logfile (.ul?)
de: kein Logfile (.ul?) anlegen

source: generate C header file with jump id's for WinHelp
de: C-Headerfile mit WinHelp-Jump-IDs erzeugen

source: generate Pascal header file with jump id's for WinHelp
de: Pascal-Headerfile mit WinHelp-Jump-IDs erzeugen

source: generate Visual-Basic header file with jump id's for WinHelp
de: VisualBasic-Headerfile mit WinHelp-Jump-IDs erzeugen

source: generate GFA header file with jump id's for WinHelp
de: GFA-Headerfile mit WinHelp-Jump-IDs erzeugen

source: write to file FILE
de: Ausgaben in die Datei DATEI schreiben

source: create project file (.upr)
de: Projekt-Datei (.upr) ausgeben

source: generate tree file (.ut?)
de: Include-Baum (.ut?) ausgeben

source: Sets the client geometry of the main window
de: Legt die Geometrie des Hauptfensters fest

source: GEOMETRY
de: GEOMETRIE

source: Show version information and exit
de: Versionsinformationen anzeigen und beenden

source: Show help information and exit
de: diese Informationen anzeigen und beenden

source: activate checkings
de: Überprüfungen aktivieren

source: press key when udo finishs
de: am Ende auf Tastendruck warten

source: suppress output to stdout and stderr
de: Ausgaben auf stdout und stderr unterdrücken

source: use test mode (no outfile will be saved)
de: Testmodus (kein Outfile erzeugen)

source: verbose mode
de: ausführliche Konvertierungs-Infos anzeigen

source: suppress warnings
de: Warnungen unterdrücken

source: suppress warnings for line lengths
de: Warnungen für Zeilenlänge unterdrücken

source: About UDO Shell
de: Über UDO Shell

source: UDO Shell for Gtk Version %s, June 2013 Copyright © 1997-2013 by Thorsten Otto Katharinenstr. 14 D-45131 Essen Germany
de: UDO Shell für Gtk Version %s, Juni 2013 Copyright © 1997-2013 by Thorsten Otto Katharinenstr. 14 D-45131 Essen Germany

source: Can't write Settings: %s %s Quit anyway?
de: Kann Einstellungen nicht sichern: %s %s Trotzdem beenden?

source: Choose UDO source file...
de: UDO Quell-Datei auswählen...

source: Choose destination file...
de: Ziel-Datei auswählen...

source: Choose editor for %s files...
de: Editor für %s Dateien wählen...

source: Please select a source file first!
de: Bitte wählen sie zunächst eine Eingabedatei aus!

source: The %s file %s doesn't exist. Start the editor anyway?
de: Die Datei %s %s existiert nicht. Editor trotzdem starten?

source: UDO and log
de: UDO und Log

source: destination
de: Ziel

source: result
de: Ergebnis

source: Directory doesn't exist!?
de: Verzeichnis existiert nicht!?

source: %d Errors
de: %d Fehler

source: %d Warnings
de: %d Warnungen

source: %d Notes
de: %d Anmerkungen

source: Couldn't make directory!
de: Kann Verzeichnis nicht erzeugen!

source: Choose UDO binary...
de: UDO-Programm auswählen...

source: No destination file available!
de: Keine Ziel-Datei angegeben!

source: The source file %s doesn't exist!
de: Die Quell-Datei %s existiert nicht!

source: The destination directory doesn't exist. Make directory now to prevent UDO from displaying an error message?
de: Das Ziel-Verzeichnis existiert nicht. Soll es jetzt angelegt werden um Fehlermeldungen zu vermeiden?

source: The %s file %s doesn't exist.
de: Die %s Datei %s existiert nicht.

source: You haven't defined an editor for UDO files! Click the upper right button while pressing the ctrl key to choose an editor.
de: Es ist kein Editor für UDO-Dateien definiert! Drücken Sie auf den oberen rechten Knopf und um einen Editor auszuwählen.

source: hyphenation pattern
de: Trennvorschläge

source: project
de: Projekt

source: udoshen.chm
de: udoshde.chm

source: udo%sen.chm
de: udo%sde.chm

source: Command Index
de: Befehlsindex

source: _File
de: _Datei

source: Select Source...
de: Quelle auswählen...

source: Select Destination...
de: Ziel auswählen...

source: _Options
de: _Optionen

source: _Format Configuration...
de: Format Konfiguration...

source: _Settings...
de: _Einstellungen...

source: _Help
de: _Hilfe

source: _Contents
de: _Inhalt

source: UDO Help
de: UDO Hilfe

source: UDO Command Index
de: UDO Befehlsindex

source: _About
de: Über

source: Source:
de: Quelle:

source: Dest:
de: Ziel:

source: Param #1:
de: Parameter #1:

source: Param #2:
de: Paraneter #2:

source: Result:
de: Ergebnis

source: Select source file
de: Quell-Datei auswählen

source: Select destination file
de: Ziel-Datei auswählen

source: program
de: Programm

source: Run UDO
de: UDO starten

source: Run application for destination
de: Anwendung für Ziel-Datei starten

source: Run application for parameter file #1
de: Anwendung für Parameter-Datei #1 starten

source: Run application for parameter file #2
de: Anwendung für Parameter-Datei #2 starten

source: Run application for result
de: Anwendung für Ergebnis starten

source: Run editor with source file
de: Editor mit Quell-Datei starten

source: Run editor with destination
de: Editor mit Ziel-Datei starten

source: Run editor with paramater file #1
de: Editor mit Parameter-Datei #1 starten

source: Run editor with paramater file #2
de: Editor mit Parameter-Datei #2 starten

source: Run editor with result file
de: Editor mit Ergebnis starten

source: Symbols
de: Symbole

source: Set the symbol `symbol' which can be tested in the source file with !ifset
de: Setzen des Symbols `symbol', welches sich im Quelltext mit dem Befehl !ifset abfragen läßt

source: Test Mode
de: Test Modus

source: Test syntax only, don't generate output file
de: Nur Syntax testen, Ausgabe-Datei wird nicht erzeugt

source: Press key
de: Auf Tastendruck warten

source: Wait for keypress when UDO finishes
de: Auf Tastendruck wenn UDO beendet ist

source: Verbose
de: Ausführlich

source: Print some status information while converting the source file
de: Bei der Konvertierung werden zusätzlich Informationen über die gerade bearbeitete Datei und das gerade bearbeitete Kapitel ausgegeben

source: Warnings
de: Warnungen

source: Show warning messages
de: Warnmeldungen ausgeben

source: Line Warnings
de: Warnungen für Zeilenlänge

source: Show warning messages for lines that are too short or long
de: Warnmeldungen für zu lange oder kurze Zeilen ausgeben

source: Check
de: Überprüfungen

source: Activate some additional checks
de: Überprüfungen aktivieren

source: Into Folder
de: In Verzeichnis

source: Create output file(s) in subdirectory
de: Ausgabedatei(en) in Unterverzeichnis erzeugen

source: Force long
de: Lange Dateinamen

source: Try to use long filenames even on operating systems that normally do not support them
de: Auch auf den Systemen, die standardmässig keine langen Dateinamen unterstützen (TOS, DOS), lange Dateinamen zu erzeugen (Endung .html anstatt .htm)

source: Force short
de: Kurze Dateinamen

source: Force use of short filenames
de: Erzwingt unter Betriebssystemen, die lange Dateinamen beherrschen, die Erzeugung von kurzen Dateinamen

source: Use newer, faster algorithm for automatic searching of references
de: Neueren, schnelleren Algorithmus für Auto-Referenzierung benutzen

source: Log file
de: Log Datei

source: Create a log file
de: Eine Log-Datei erzeugen

source: Hyphen file
de: Trenn Datei

source: Create a hyphen file
de: Eine Datei mit Trennvorschlägen erzeugen

source: Tree file
de: Tree Datei

source: Create a tree file with the include structure
de: Eine Tree-Datei mit der Include-Struktur erzeugen

source: Create a header file for C with the WinHelp-Jump-IDs
de: Eine Header-Datei für C mit allen Jump-IDs erzeugen

source: Create a map file with the WinHelp-Jump-IDs for Pascal/Delphi
de: Eine Header-Datei für Pascal/Delphi mit allen Jump-IDs erzeugen

source: Create a map file with the WinHelp-Jump-IDs for Visual Basic
de: Eine Header-Datei für VisualBasic mit allen Jump-IDs erzeugen

source: Create a map file with the WinHelp-Jump-IDs for GFA Basic
de: Eine Header-Datei für GFA Basic mit allen Jump-IDs erzeugen

source: UPR file
de: UPR Datei

source: Save a file with the suffix .upr with a list of all source files, include files and generated files
de: Eine Projekt-Datei mit der Endung .upr mit einer Liste der benutzten und erzeugten Dateien anlegen

source: Start the editor with the log file
de: Editor mit der Log-Datei starten

source: Start the editor with the hyphen file
de: Editor mit der Hyphen-Datei starten

source: Start the editor with the tree file
de: Editor mit der Tree-Datei starten

source: Start the editor with the C header file
de: Editor mit der C-Header Datei starten

source: Start the editor with the Pascal header file
de: Editor mit der Pascal-Header Datei starten

source: Start the editor with the VisualBasic header file
de: Editor mit der VisualBasic-Header Datei starten

source: Start the editor with the GFA header file
de: Editor mit der GFA-Header Datei starten

source: Start the editor with the project file
de: Editor mit der Projekt-Datei starten

source: Error
de: Fehler

source: Warning
de: Warnung

source: %s: error initializing GTK (wrong display?)
de: %s: Fehler bei initialisieren von GTK (falsches Display?)

source: [FILE]
de: [DATEI]

source: GTK Shell for UDO
de: GTK Shell für UDO

source: Format options
de: Format Optionen

source: Show format options
de: Format-Optionen anzeigen

source: Output options
de: Ausgabe Optionen

source: Show output options
de: Ausgabe-Optionen anzeigen

source: error parsing command line
de: Fehler in der Kommandozeile

source: Press <RETURN>...
de: <RETURN> drücken...

source: source
de: Quelle

source: *.exe *.bat *.cmd|Program files (*.exe;*.bat;*.cmd) *.*|All files (*.*)
de: *.exe *.bat *.cmd|Programm-Dateien (*.exe;*.bat;*.cmd) *.*|Alle Dateien (*.*)

source: *.u*|UDO files (*.u*) *.*|All files (*.*)
de: *.u*|UDO Dateien (*.u*) *.*|Alle Dateien (*.*)

source: *.*|All files (*.*)
de: *.*|All Dateien (*.*)

source: *.hlp *.chm|Help files (*.hlp;*.chm) *.*|All files (*.*)
de: *.hlp *.chm|Hilfe-Dateien (*.hlp;*.chm) *.*|Alle Dateien (*.*)
