Repository: UlfDunkel/UDO
Catalog: po/*.po
Languages: de

source: This text was made with
de: Dieser Text wurde erzeugt mit

source: UDO is Open Source (!nl)
de: UDO ist Open Source (!nl)

source: UDO is an application that converts text files which you
de: UDO ist ein Programm, mit dem Sie Textdateien, die im

source: have written in Universal Document Format, into more than
de: Universal-Document-Format erstellt wurden, in (!"u)ber

source: 25 different target formats.
de: 25 Zielformate umwandeln k(!"o)nnen.

source: Get further information and the current versions on the Internet at (!nl)
de: Weitere Informationen sowie die aktuellen Versionen finden Sie im Internet unter (!nl)

source: %x maybe not available in LaTeX
de: %x möglicherweise nicht verfügbar in LaTeX

source: Reading %s
de: Lese %s

source: UDO is Open Source (see %s for further information).
de: UDO ist Open Source (siehe %s für weitere Informationen).

source: usage: %s [-acdDghHilmnpPqrstvwWxy@] [-o outfile] file
de: Gebrauch: %s [-acdDghHilmnpPqrstvwWxy@] [-o outfile] file

source: formats:
de: Formate:

source: -a, --asc convert to ASCII
de: -a, --asc ins ASCII-Format konvertieren

source: --amg convert to AmigaGuide
de: --amg ins AmigaGuide-Format konvertieren

source: --aqv, --quickview convert to Apple QuickView
de: --aqv, --quickview ins Apple-QuickView-Format konvertieren

source: -c, --c generate C sourcecode
de: -c, --c C-Sourcecode erzeugen

source: --drc convert to David's Readme Compiler format
de: --drc ins David's-Readme-Compiler-Format konvertieren

source: -f --pdflatex generate PDFLaTeX sourcecode
de: -f --pdflatex ins PDFLaTeX-Format konvertieren

source: -g, --helptag convert to HP Helptag SGML
de: -g, --helptag ins HP-Helptag-SGML-Format konvertieren

source: -h, --html convert to HTML
de: -h, --html ins HTML-Format konvertieren

source: --hah convert to HTML Apple Help
de: --hah ins HTML-Apple-Help-Format konvertieren

source: -hh, --htmlhelp convert to HTML-Help
de: -hh, --htmlhelp ins HTML-Help-Format konvertieren

source: -i, --info convert to GNU Texinfo
de: -i, --info ins GNU-Texinfo-Format konvertieren

source: --ipf convert to OS/2 IPF format
de: --ipf ins OS/2-IPF-Format konvertieren

source: --lyx convert to LyX
de: --lyx ins LyX-Format konvertieren

source: -m, --man convert to a manualpage
de: -m, --man in eine Manualpage konvertieren

source: -n, --nroff convert to nroff
de: -n, --nroff ins nroff-Format konvertieren

source: -p, --pchelp convert to Pure C Help
de: -p, --pchelp ins Pure-C-Help-Quelltextformat konvertieren

source: -P, --pascal generate Pascal sourcecode
de: -P, --pascal Pascal-Sourcecode erzeugen

source: --ps convert to PostScript
de: --ps ins PostScript-Format konvertieren

source: -r, --rtf convert to RTF
de: -r, --rtf ins Rich Text Format konvertieren

source: -s, --stg convert to ST-Guide
de: -s, --stg ins ST-Guide-Quelltextformat konvertieren

source: -t, --tex convert to LaTeX
de: -t, --tex ins LaTeX-Format konvertieren

source: -u, --udo collect all files and save in UDO format
de: -u, --udo Dateien sammeln und in einer UDO-Datei sichern

source: -v, --vision convert to Turbo Vision Help
de: -v, --vision ins Turbo-Vision-Help-Format konvertieren

source: -w, --win convert to WinHelp
de: -w, --win ins WinHelp-Quelltextformat konvertieren

source: -4, --win4 convert to WinHelp4
de: -4, --win4 ins WinHelp4-Quelltextformat konvertieren

source: -x, --linuxdoc convert to Linuxdoc SGML
de: -x, --linuxdoc ins Linuxdoc-SGML-Format konvertieren

source: output files:
de: Ausgabedateien:

source: --force-long save always long filenames
de: --force-long immer lange Dateinamen erzeugen

source: --force-short save always short filenames
de: --force-short immer kurze Dateinamen erzeugen

source: -d, --no-idxfile don't generate index file (.ux?)
de: -d, --noidxfile kein Indexfile (.ux?) anlegen

source: -y, --no-hypfile don't generate hyphen file (.uh?)
de: -y, --no-hypfile kein Hyphenfile (.uh?) anlegen

source: -l, --no-logfile don't generate logfile (.ul?)
de: -l, --nologfile kein Logfile (.ul?) anlegen

source: --map generate C header file with jump id's for WinHelp
de: --map C-Headerfile mit WinHelp-Jump-IDs erzeugen

source: --map-pas generate Pascal header file with jump id's for WinHelp
de: --map-pas Pascal-Headerfile mit WinHelp-Jump-IDs erzeugen

source: --map-vb generate VB header file with jump id's for WinHelp
de: --map-vb VB-Headerfile mit WinHelp-Jump-IDs erzeugen

source: --map-gfa generate GFA header file with jump id's for WinHelp
de: --map-gfa GFA-Headerfile mit WinHelp-Jump-IDs erzeugen

source: -o F, --outfile F write to file F
de: -o F, --outfile F Ausgaben in die Datei F schreiben

source: --save-upr create project file (.upr)
de: --save-upr Projekt-Datei (.upr) ausgeben

source: --tree generate tree file (.ut?)
de: --tree Include-Baum (.ut?) ausgeben

source: others:
de: Sonstiges:

source: --check activate checkings
de: --check Überprüfungen aktivieren

source: -D sym,--define sym set symbol <sym>
de: -D sym,--define sym Symbol <sym> setzen

source: -H, --hold press key when udo finishes
de: -H, --hold am Ende auf Tastendruck warten

source: -q, --quiet suppress output to stdout and stderr
de: -q, --quiet Ausgaben auf stdout und stderr unterdrücken

source: --test use test mode (no outfile will be saved)
de: --test Testmodus (kein Outfile erzeugen)

source: --verbose verbose mode
de: --verbose ausführliche Konvertierungs-Infos anzeigen

source: -W, --no-warnings suppress warnings
de: -W, --no-warnings Warnungen unterdrücken

source: -Wl, --no-warningslines suppress warnings for line lengths
de: -Wl, --no-warningslines Warnungen für Zeilenlänge unterdrücken

source: -@ F read options from file F
de: -@ F Optionen aus der Datei F lesen

source: --help show this helppage and exit
de: --help diese Informationen anzeigen und beenden

source: --version show version of UDO and exit
de: --version Versionsinformationen anzeigen und beenden

source: Press <RETURN>...
de: <RETURN> drücken...

source: %s: unknown option! %s
de: %s: Unbekannte Option! %s

source: use --help for more information
de: Mehr Hilfe mit --help

source: '!short' is a deprecated attribute for environments. Please use '!compressed' instead.
de: '!short' ist ein überholtes Attribut für Umgebungen. Bitte benutzen Sie '!compressed' stattdessen.

source: too many environments used
de: Zu viele Environments benutzt

source: '!item' outside environment
de: '!item' ausserhalb Environment

source: Preface
de: Vorwort

source: Chapter
de: Kapitel

source: Title
de: Titel

source: Appendix
de: Anhang

source: Contents
de: Inhaltsverzeichnis

source: List of Figures
de: Abbildungsverzeichnis

source: List of Tables
de: Tabellenverzeichnis

source: Figure
de: Abbildung

source: Table
de: Tabelle

source: page
de: Seite

source: see
de: siehe

source: see also
de: siehe auch

source: by
de: von

source: for
de: für

source: &Up
de: &Hoch

source: E&xit
de: Bee&nden

source: Unknown
de: Unbekannt

source: Last updated on
de: Letzte Aktualisierung am

source: 0x409
de: 0x407

source: Up
de: Hoch

source: Prev
de: Vorige

source: Next
de: Nächste

source: Begin of the document
de: Beginn des Dokumentes

source: Translation:
de: Übersetzung:

source: Distributor:
de: Vertrieb:

# tex_stylename
source: english
de: german,a4

# lyx_langname
source: english
de: german

source: degree
de: Grad

# today
source: %2$s %3$d, %1$d
de: %3$d. %2$s %1$d

# short_today
source: %1$0d/%2$02d/%3$02d
de: %3$02d.%2$02d.%1$d

source: January
de: Januar

source: February
de: Februar

source: March
de: März

source: May
de: Mai

source: June
de: Juni

source: July
de: Juli

source: October
de: Oktober

source: December
de: Dezember

source: Warning
de: Warnung

source: Error
de: Fehler

source: Note
de: Anmerkung

source: Fatal Error
de: Fataler Fehler

source: ######## errors, warnings and notes:
de: ######## Fehler, Warnungen und Anmerkungen:

source: interruption
de: Unterbrechung

source: %s written to %s%s
de: %s geschrieben in %s%s

source: couldn't open logfile <%s>
de: Kann Log-Datei <%s> nicht öffnen

source: couldn't open hyphen file <%s>
de: Kann Trennungs-Datei <%s> nicht öffnen

source: couldn't open index file <%s>
de: Kann Index-Datei <%s> nicht öffnen

source: couldn't open treefile <%s>
de: Kann Tree-Datei <%s> nicht öffnen

source: couldn't open project file <%s>
de: Kann Projekt-Datei <%s> nicht öffnen

source: couldn't open destination file <%s>
de: Kann Ziel-Datei <%s> nicht öffnen

source: couldn't open source file <%s>
de: Kann Quell-Datei <%s> nicht öffnen

source: couldn't write IMG header of <%s>
de: Kann IMG-Datei <%s> nicht schreiben

source: couldn't read IMG header of <%s>
de: Kann IMG-Datei <%s> nicht lesen

source: couldn't read BMP header of <%s>
de: Kann BMP-Datei <%s> nicht lesen

source: couldn't read PCX header of <%s>
de: Kann PCX-Datei <%s> nicht lesen

source: couldn't read MSP header of <%s>
de: Kann MSP-Datei <%s> nicht lesen

source: couldn't read GIF header of <%s>
de: Kann GIF-Datei <%s> nicht lesen

source: couldn't read PNG header of <%s>
de: Kann PNG-Datei <%s> nicht lesen

source: couldn't read JPEG header of <%s>
de: Kann JPEG-Datei <%s> nicht lesen

source: couldn't open <%s>: %s
de: Kann <%s> nicht öffnen: %s

source: couldn't make directory <%s>: %s
de: Kann Verzeichnis <%s> nicht erzeugen: %s

source: failed to allocate %lu bytes
de: Nicht genug Speicher für %lu bytes

source: empty !docinfo
de: Leeres !docinfo Kommando

source: syntax error
de: Syntaxfehler

source: '%s' without '%s'
de: '%s' ohne '%s'

source: too many items inside enumeration
de: Zu viele !items in Enumeration

source: '%s' expected
de: '%s' erwartet

source: '%s' called twice
de: '%s' zweimal benutzt

source: %s not active
de: %s nicht aktiv

source: %s already active
de: %s bereits aktiv

source: %s still active
de: %s noch aktiv

source: missing parameter(s) at %s
de: Fehlende Parameter für %s

source: wrong number of parameters: %s
de: Falsche Anzahl Parameter: %s

source: unexpected end of line in command
de: Unerwartetes Zeilenende im Kommand

source: too many words used inside paragraph
de: Zu viele Wörter im Paragraph

source: couldn't replace (%s ...)
de: Kann Parameter nicht ersetzen (%s ...)

source: link destination undefined: '%s'
de: link-Ziel nicht definiert: '%s'

source: last '!if': <%s> line %lu
de: letztes '!if': <%s> Zeile %lu

source: charset/encoding %s not supported
de: Zeichensatz %s wird nicht unterstützt

source: use !%snode first (structure gap)
de: Benutzen Sie !%snode zuerst (Lücke in der Struktur)

source: Warning: %s %lu: overfull line: %d
de: Warning: %s %lu: Zeile zu lang: %d

source: check this paragraph: %s
de: Prüfen sie diesen Paragraph: %s

source: Warning: %s %lu: too short line: %d: %s
de: Warning: %s %lu: Zeile zu kurz: %d: %s

source: cannot convert %s #0x%x to %s
de: Kann %s #0x%x nicht in %s konvertieren

source: can't convert UTF-8 (%s) to %s
de: Kann UTF-8 (%s) nicht in %s konvertieren

source: %x not available in ISO Latin 1
de: %x nicht verfügbar in ISO Latin 1

source: structure depth exceeded, using %s
de: Strukturtiefe überschritten, benutze %s

source: %s: buffer overrun prevented: %s: %u>%u
de: %s: Pufferüberlauf verhindert: %s: %u>%u

source: AmigaGuide cannot link to label '%s'
de: AmigaGuide kennt kein link zu Label '%s'

source: xlink needs WinHelp destination topic
de: xlink benötigt WinHelp Zielverweis

source: xlink needs WinHelp destination file
de: xlink benötigt WinHelp Zieldatei

source: use (!xlink [text] [topic@foo.hlp])
de: Benutzen Sie (!xlink [text] [topic@foo.hlp])

source: too many parameters used
de: Zu viele Parameter benutzt

source: not replaced %3lu:%3lu: %c%c%c %s %s
de: nicht ersetzt %3lu:%3lu: %c%c%c %s %s

source: %x not allowed in macro name
de: %x nicht erlaubt in Makronamen

source: macro name longer than %d characters
de: Makroname länger als %d Zeichen

source: redefining internal command (!%s)
de: internes Kommando (!%s) neu definiert

source: macro contents longer than %d characters
de: Makroinhalt länger als %d Zeichen

source: definition name longer than %d characters
de: Definitionsname länger als %d Zeichen

source: definition contents longer than %d characters
de: Definitionstext länger als %d Zeichen

source: internal command (!%s) cannot be undefined
de: Internes Kommando (!%s) kann nicht gelöscht werden

source: possibly undefined macro: %s
de: Makro möglicherweise nicht definiert: %s

source: Color
de: Farbe

source: please use (!V) and (!v) in one paragraph
de: Bitte benutzen Sie (!V) und (!v) innerhalb eines Absatzes

source: too many columns used
de: Zu viele Spalten in der Tabelle

source: invalid column alignment '%s'
de: ungültige Spaltenausrichtung '%s'

source: too many rows used
de: Zu viele Zeilen in der Tabelle

source: too many labels used in table
de: Zu viele labels in der Tabelle

source: !hline for the first table line has to be placed in the table header
de: !hline vor der ersten Tabellen-Zeile muss in der Kopfzeile angegeben werden

source: table cell contains too many characters
de: Tabellen-Zelle enthält zu viele Zeichen

source: horizontal table lines will be truncated
de: Horizontale Tabellenlinien werden abgeschnitten

source: invalid table_alignment '%s'
de: Ungültige Tabellenausrichtung '%s'

source: ! empty filename: %d,%d,%d,%d,%d,%d,%d,%d,%d (%d)
de: ! leerer Dateiname: %d,%d,%d,%d,%d,%d,%d,%d,%d (%d)

source: ! using 'error' instead
de: ! 'error' wird benutzt stattdessen

source: ! please inform the author (%s)!
de: ! bitte den Author informieren (%s)!

source: Sorting index...
de: Sortiere Index...

source: windows button %s not defined
de: Windows Button %s ist nicht definiert

source: mapping not numeric or not of type integer
de: Mapping ist nicht numerisch

source: missing node name
de: Fehlende Überschrift

source: Checking nodes, labels and aliases...
de: Prüfe Nodes, Labels und Aliase...

source: label "%s" used twice
de: label "%s" wird zweimal benutzt

source: as a label
de: als label

source: as a node
de: als Überschrift

source: as an alias
de: als Alias

source: in node '%s'
de: in Überschrift '%s'

source: Checking HTML file names...
de: Prüfe HTML Dateinamen...

source: file name "%s" used in "%s" and "%s"
de: Dateiname "%s" benutzt in "%s" und "%s"

source: Checking usage of labels and aliases...
de: Prüfe Benutzung von Label und Alias

source: %s %lu: label/alias '%s' in node '%s' wasn't referenced
de: %s %lu: label/alias '%s' in Überschrift '%s' wurde nicht benutzt

source: unknown html_navigation: %s
de: Unbekannte html_navigation: %s

source: wrong argument for !html_header_date: %s, e.g. +01:00
de: Falsched Argument für !html_header_date: %s, z.B. +01:00

source: empty !html_header_links
de: Leeres !html_header_links-Kommando

source: unknown linktype (!html_header_links): %s
de: Unbekannter Link-Typ für !html_header_links: %s

source: node is merged, ignoring !html_name
de: Node wird zusammengefasst, ignoriere !html_name

source: global style sheet %s already used
de: Globales Stylesheet %s wird bereits benutzt

source: style sheet %s already used in node %s
de: Stylesheet %s wird bereits benutzt in Node %s

source: global script %s already used
de: Globales Script %s wird bereits benutzt

source: script %s already used in node %s
de: Script %s bereits benutzt in Node %s

source: !docinfo [webmastername] is deprecated, use !docinfo [domain_name] instead
de: !docinfo [webmastername] ist überholt, benutzen Sie !docinfo [domain_name] stattdessen

source: !docinfo [webmasterurl] is deprecated, use !docinfo [domain_link] instead
de: !docinfo [webmasterurl] ist überholt, benutzen Sie !docinfo [domain_link] stattdessen

source: !docinfo [webmasteremail] is deprecated, use !docinfo [contact_name] instead
de: !docinfo [webmasteremail] ist überholt, benutzen Sie !docinfo [contact_name] stattdessen

source: !docinfo [webmastermailurl] is deprecated, use !docinfo [contact_link] instead
de: !docinfo [webmastermailurl] ist überholt, benutzen Sie !docinfo [contact_link] stattdessen

source: unknown !docinfo: %s
de: Unbekanntes !docinfo Kommando: %s

source: no title data available
de: Keine Titeldaten verfügbar

source: stringcenter(): length must not exceed %d!
de: stringcenter(): Länge darf %d nicht überschreiten!

source: strcenter(): length must not exceed %d!
de: strcenter(): Länge darf %d nicht überschreiten!

source: outlncenterfill(): string must not be longer than %d characters
de: outlncenterfill(): Länge darf %d nicht überschreiten!

source: strjustify(): string must not be longer than %d characters
de: strjustify(): Länge darf %d nicht überschreiten!

source: %s ignored outside preamble
de: %s wird ignoriert nach !begin_document

source: %s ignored inside preamble
de: %s wird ignoriert vor !begin_document

source: unknown !language: %s
de: Unbekannte Sprache: %s

source: unknown output format: %s
de: Unbekanntes Ausgabeformat: %s

source: unknown os: %s
de: unbekanntes System: %s

source: use "unix" to test for unix systems
de: Benutzen Sie "unix" um für Unix-Systeme zu testen

source: unknown color: %s
de: Unbekannte Farbe: %s

source: odd number of ""
de: ungerade Anzahl von ""

source: odd number of ''
de: ungerade Anzahl von ''

source: $UDOINPUTPATH not set!
de: $UDOINPUTPATH nicht gesetzt!

source: unknown command: %s
de: Unbekanntes Kommando: %s

source: Reading hyphen file...
de: Lese Hyphen-Datei...

source: Sorting hyphen file...
de: Sortiere Hyphen-Datei...

source: Writing hyphen file...
de: Schreibe Hyphen-Datei...

source: too many files opened
de: Zu viele Dateien göffnet

source: too many !if
de: Zu viele !if

source: language %s not supported
de: Sprache %s wird nicht unterstützt

source: more than %d buttons defined
de: Mehr als %d Knöpfe definiert

source: Recursive !include detected
de: Rekursives !include entdeckt

source: !code is deprecated, use !code_source instead
de: !code is überholt, benutzen Sie !code_source stattdessen

source: check this paragraph
de: Prüfen sie diesen Paragraph

source: UDO cannot handle nested tables
de: UDO kann verschachtelte Tabellen nicht behandeln

source: Output (%lu lines) written to %s
de: Ausgabe (%lu Zeilen) geschrieben in %s

source: Output: %lu lines
de: Ausgabe: %lu Zeilen

source: Warnings: %d
de: Warnungen: %d

source: Notes: %d
de: Anmerkungen: %d

source: Errors: %d
de: Fehler: %d

source: source and destination file are equal: <%s>
de: Quell- und Ziel-Datei sind identisch: <%s>

source: symbol %s not set
de: Symbol %s ist nicht gesetzt
